NextFOAM-2501/tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 292
);

regions
(
    boxToCell
    {
        box (0.002 -0.01 0.005) (0.02 0.01 0.055);
        fieldValues
        (
            volScalarFieldValue T 2200
        );
    }
);


// ************************************************************************* //
